app/controllers/quotes_controller.rb

  def show
    @quote = Quote.find(params[:id])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @quote = Quote.new(quote_params)

    respond_to do |format|
      if @quote.save
---
INSERT INTO "quotes" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "ricard and sun "], ["user_id", 20], ["created_at", "2022-05-08 10:02:41.695526"], ["updated_at", "2022-05-08 10:02:41.695526"]]

  def update
    respond_to do |format|
      if @quote.update(quote_params)
---
UPDATE "quotes" SET "content" = $1, "updated_at" = $2 WHERE "quotes"."id" = $3  [["content", "Van Halen yo!"], ["updated_at", "2022-05-08 07:49:18.021964"], ["id", 3]]